requisições/req_2026-02-26T14-32-27-619Z_SaveRecord.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tot="http://www.totvs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <tot:SaveRecord>
         <!--Optional:-->
         <tot:DataServerName>GlbConsSqlData</tot:DataServerName>
         <!--Optional:-->
         <tot:XML><![CDATA[<GlbConsSql>
  <GConsSql>
    <CODCOLIGADA>1</CODCOLIGADA>
    <APLICACAO>T</APLICACAO>
    <CODSENTENCA>SIT.PORTALRM.002</CODSENTENCA>
    <TITULO>Retorna Acessos aos Menus</TITULO>
    <SENTENCA>SELECT
-- Verifica acesso à Solicitação de Compras
CASE
WHEN EXISTS (
SELECT 1
FROM TUSRTMV tu
JOIN TTMV tt
ON tu.CODCOLIGADA = tt.CODCOLIGADA
AND tu.CODTMV = tt.CODTMV
WHERE tu.CODUSUARIO = :CODUSUARIO
AND tt.CLASSIFICACAO = '04.06.01'
) THEN 1
ELSE 0
END AS MNUSC,
-- Verifica acesso ao menu específico
CASE
WHEN EXISTS (
SELECT 1
FROM GAUTZMENU a
LEFT JOIN GUSRPERFIL b
ON a.CODSISTEMA = b.CODSISTEMA AND a.CODPERFIL = b.CODPERFIL
LEFT JOIN GUSUARIO c
ON b.CODUSUARIO = c.CODUSUARIO
WHERE a.CODSISTEMA = 'F'
AND a.TAGMENU IN ('810000029','810000041','810001000')
AND a.PERMISSOES IN ('*','**')
AND c.CODUSUARIO = :CODUSUARIO
) THEN 1
ELSE 0
END AS MNULF,
-- Verifica aceso nos menus do Labore
CASE
WHEN EXISTS (
SELECT 1
FROM GAUTZMENU a
LEFT JOIN GUSRPERFIL b
ON a.CODSISTEMA = b.CODSISTEMA AND a.CODPERFIL = b.CODPERFIL
LEFT JOIN GUSUARIO c
ON b.CODUSUARIO = c.CODUSUARIO
WHERE a.CODSISTEMA = 'P'
/*AND a.TAGMENU IN ('810000029','810000041','810001000')
AND a.PERMISSOES IN ('*','**')*/
AND c.CODUSUARIO = :CODUSUARIO
) THEN 1
ELSE 0
END AS MNULB</SENTENCA>
    <TAMANHO>1051</TAMANHO>
    <DTULTALTERACAO>2026-02-26T11:32:27.0000000-03:00</DTULTALTERACAO>
    <USRULTALTERACAO>mestre</USRULTALTERACAO>
    <DISPONIVELFILTRO>1</DISPONIVELFILTRO>
    <DISPONIVELRELATORIO>1</DISPONIVELRELATORIO>
    <DISPONIVELVISAO>1</DISPONIVELVISAO>
    <DISPONIVELMENU>0</DISPONIVELMENU>
    <SEMSEGCOLUNAS>0</SEMSEGCOLUNAS>
    <SEMSEGESTENDIDA>0</SEMSEGESTENDIDA>
    <GUID>c0671e6c-2b24-42c9-a3a7-b177120a97d0</GUID>
    <CONTROLE>64929</CONTROLE>
  </GConsSql>
</GlbConsSql>]]></tot:XML>
         <!--Optional:-->
         <tot:Contexto>CODCOLIGADA=1;CODUSUARIO='mestre';CODSISTEMA=T</tot:Contexto>
      </tot:SaveRecord>
   </soapenv:Body>
</soapenv:Envelope>